# GetCurrent Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComponentRepeaterIterator..::..GetCurrent Method
ComponentRepeaterIterator Class See Also
---
Returns the current repeater slot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ComponentRepeaterSlot GetCurrent()
```

Visual Basic
---
```text
Public Function GetCurrent As ComponentRepeaterSlot
```

Visual C++
---
```text
public:
ComponentRepeaterSlot^ GetCurrent()
```

# ### Return Value
The current slot.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
ComponentRepeaterIterator Class
Autodesk.Revit.DB Namespace